<!--数据库连接文件#include file="../INC/SQLconn.asp" -->
<!--数据库连接文件#include file="top.asp" -->
<LINK href="../images/Style.css" rel=stylesheet>
<TITLE>服务条款－聊弯聊天室用户注册</TITLE>
<style>
<!--
TD			{FONT-SIZE: 12px; COLOR: #000000; WORD-BREAK: break-all; }
.text			{FONT-SIZE: 13px; line-height: 160%;font-family: "宋体"}
.en			{FONT-FAMILY: verdana; FONT-SIZE: 11px; }
-->
</style>
<% call top %>

<%

if un<>"" then errstr("请先退出登陆再注册！\n退出方法:点退出登陆按扭")

%>
<div align="center">
  <center>
  <table border="0" cellpadding="0" cellspacing="0" style="border-collapse: collapse" bordercolor="#111111" width="503" id="AutoNumber1" height="571">
    <tr>
      <td width="650" height="19">　</td>
    </tr>
    <tr>
      <td width="650" height="486">
      <table cellSpacing="0" cellPadding="0" width="495" border="0" style="border-collapse: collapse" bordercolor="#111111" height="75">
        <tr>
          <td align="left" height="44" width="640"><b>
          <font class="titletext" color="#ff0000">
          <img border="0" src="img/Main_02.gif">聊湾用户服务条款</font></b> <font class="titletext" color="#ff0000">
          [第一步 阅读服务条款]</font></td>
        </tr>
        <tr>
          <td background="../images/vip_dot.gif" height="1" width="640"></td>
        </tr>
        
        <tr>
          <td height="30" width="640"></td>
        </tr>
        
      </table>
      <table cellSpacing="1" cellPadding="0" width="495" border="0" height="303">
        <tr>
          <td vAlign="top" width="462" height="128">
          <p>
          

<STYLE type=text/css>
.txtbody {
SCROLLBAR-FACE-COLOR:#D3FF23; SCROLLBAR-HIGHLIGHT-COLOR:#D3FF23; SCROLLBAR-SHADOW-COLOR: #ffffff; SCROLLBAR-3DLIGHT-COLOR: #D3FF23; SCROLLBAR-ARROW-COLOR: #9DC207; SCROLLBAR-TRACK-COLOR: #ffffff; SCROLLBAR-DARKSHADOW-COLOR: #D3FF23; border: 1px #9DC207 solid
}
</STYLE>
          
          
<textarea class=txtbody name="textfield" rows="16" cols="65">
Ⅰ.聊天、留言、上传照片等应注意什么？ 
请遵守《中华人民共和国计算机信息系统安全保护条例》、《计算机信息网络国际联网安全保护管理办法》、《中华人民共和国计算机信息网络国际联网管理暂行规定实施办法》里的一切规定。 
希望网友之间相互尊重，不得故意使用甚至恶意雷同或仿冒现有的用户名，经劝阻无效的情况下，管理员有权把违反规定者请出聊天站。 
尊重网上道德。互相尊重，请不要用不雅言词， 严禁发表反动、色情以及其他违反国家法律规定的言论。 
使用轻松而健康的话题，所以请不要涉及政治、宗教等敏感话题。 
严禁上传色情、淫秽、反动、不雅、带有性别歧视、种族歧视、个人侮辱、自侮辱、猥亵等各种有违国家相关法规规定的照片。 
承担一切因您的行为而直接或间接导致的民事或刑事法律责任。 


Ⅱ.以下行为是不受本站欢迎的行为，当以下行为出现时，管理员有权将违规者请出本站，不需要警告:
发表反动、色情以及其他违反国家法律规定的言论的； 
发表漫骂、辱骂及包含人身攻击的； 
重复发表相同或类似的内容或连续漫无目的地使用EMOTE进行刷屏； 
故意反复宣传某站点或者明显的商业广告行为； 
使用带有性别歧视、种族歧视、个人侮辱、自侮辱、猥亵等不雅ID或者昵称； 
故意长时间在聊天室练习使用emote并引起其他聊天室用户反感的行为； 
在聊天室使用emote“聚众打架”是不受赞赏的行为，情节严重者将全部予以驱逐； 
使用“悄悄话”功能对某人或者某些人进行上述行为；
聊天室内严禁使用色情、反动、带人身攻击的用户名或昵称，一旦发现马上驱逐。 



Ⅲ.聊湾网络服务使用协议

1. 聊湾网络服务条款的确认和接纳
1.1聊湾的各项电子服务的所有权和运作权归广东省电信公司湛江市分公司。聊湾提供的服务将完全按照其发布的章程、服务条款和操作规则严格执行。用户必须完全同意所有服务条款并完成注册程序，才能成为聊湾的正式用户。

2. 服务简介
2.1 聊湾运用自己的网络系统通过国际互联网络为用户提供网络服务，聊湾网络服务的具体内容由聊湾根据实际情况提供，例如聊天室、论坛(BBS)、留言簿、电子邮件等。聊湾保留随时变更、中断或终止部分或全部网络服务的权利。
2.2 聊湾在提供网络服务时，可能会对部分网络服务的用户收取一定的费用。在此情况下，聊湾会在相关页面上做明确的提示。如用户拒绝支付该等费用，则不能使用相关的网络服务。
2.3 用户理解，聊湾仅提供相关的网络服务，除此之外与相关网络服务有关的设备（如电脑、调制解调器及其他与接入互联网有关的装置）及所需的费用（如为接入互联网而支付的电话费及上网费）均应由用户自行负担。

3. 使用规则
3.1 用户在申请使用聊湾网络服务时，必须向聊湾提供详尽、准确的个人资料，如个人资料有任何变动，必须及时更新。如果用户提供的资料包含有不正确的信息，聊湾保留结束用户使用网络服务资格的权利。
3.2 用户注册成功后，聊湾将给予每个用户一个用户帐号及相应的密码，该用户帐号和密码由用户负责保管；用户应当对以其用户帐号进行的所有活动和事件负法律责任。
3.3 用户必须同意接受聊湾通过电子邮件或其他方式向用户发送的商品促销或其他相关商业信息。
3.4 用户在使用聊湾网络服务过程中，必须遵循以下原则：
(a) 遵守中国有关的法律和法规；
(b) 不得为任何非法目的而使用网络服务系统；
(c) 遵守所有与网络服务有关的网络协议、规定和程序；
(d) 不得利用聊湾网络服务系统进行任何可能对互联网的正常运转造成不利影响的行为；
(e) 不得利用聊湾网络服务系统传输任何骚扰性的、中伤他人的、辱骂性的、恐吓性的、庸俗淫秽的或其他任何非法的信息资料；
(f) 不得利用聊湾网络服务系统进行任何不利于聊湾的行为；
(g) 如发现任何非法使用用户帐号或帐号出现安全漏洞的情况，应立即通告聊湾。 

4. 服务条款的修改和服务修订
4.1 聊湾有权在必要时修改服务条款，聊湾服务条款一旦发生变动，将会在重要页面上提示修改内容。
4.2 如果不同意所改动的内容，用户可以主动取消获得的网络服务。如果用户继续享用网络服务，则视为接受服务条款的变动。聊湾保留随时修改或中断服务而不需知照用户的权利。聊湾行使修改或中断服务的权利，不需对用户或第三方负责。

5. 用户隐私制度
5.1 尊重用户个人隐私是聊湾的一项基本政策。聊湾保证不对外公开或向第三方提供用户注册资料及用户在使用网络服务时存储在聊湾的非公开内容，但下列情况除外：
(a) 事先获得用户的明确授权；
(b) 根据有关的法律法规要求；
(c) 按照相关政府主管部门的要求；
(d) 为维护社会公众的利益；
(e) 为维护聊湾的合法权益。
5.2 聊湾可能会与第三方合作向用户提供相关的网络服务，在此情况下，如该第三方同意承担与聊湾同等的保护用户隐私的责任，则聊湾可将用户的注册资料等提供给该第三方。
5.3 在不透露单个用户隐私资料的前提下，聊湾有权对整个用户数据库进行分析并对用户数据库进行商业上的利用。

6. 免责声明
6.1 用户明确同意其使用聊湾网络服务所存在的风险将完全由其自己承担；因其使用聊湾网络服务而产生的一切后果也由其自己承担，聊湾对用户不承担任何责任。
6.2 聊湾不担保网络服务一定能满足用户的要求，也不担保网络服务不会中断，对网络服务的及时性、安全性、准确性也都不作担保。

7. 对用户信息的存储和限制
7.1 聊湾不对用户所发布信息的删除或储存失败负责。聊湾有判定用户的行为是否符合聊湾服务条款的要求和精神的保留权利，如果用户违背了服务条款的规定，聊湾有中断对其提供网络服务的权利。

8. 服务变更、中断或终止
8.1 如因系统维护或升级的需要而需暂停网络服务，聊湾将尽可能事先进行通告。
8.2 如发生下列任何一种情形，聊湾有权随时中断或终止向用户提供本协议项下的网络服务而无需通知用户：
(a) 用户提供的个人资料不真实；
(b) 用户违反本协议中规定的使用规则。
8.3 除前款所述情形外，聊湾同时保留在不事先通知用户的情况下随时中断或终止部分或全部网络服务的权利，对于所有服务的中断或终止而造成的任何损失，聊湾无需对用户或任何第三方承担任何责任。

9. 违约赔偿
9.1 用户同意保障和维护聊湾及其他用户的利益，如因用户违反有关法律、法规或本协议项下的任何条款而给聊湾或任何其他第三人造成损失，用户同意承担由此造成的损害赔偿责任。

10. 通告
10.1 本协议项下所有的通知均可通过重要页面公告、电子邮件或常规的信件传送等方式进行；服务条款的修改、服务变更、或其它重要事件的通告都会以此形式进行；该等通知于发送之日视为已送达收件人。

11. 参与广告策划
11.1 用户在他们发表的信息中加入宣传资料或参与广告策划，在聊湾的免费服务上展示他们的产品，任何这类促销方法，包括运输货物、付款、服务、商业条件、担保及与广告有关的描述都只是在相应的用户和广告销售商之间发生。广东省电信公司湛江市分公司不承担任何责任，聊湾没有义务为这类广告销售负任何一部分的责任。

12. 网络服务内容的所有权
12.1 聊湾定义的网络服务内容包括：文字、软件、声音、图片、录象、图表、广告中的全部内容；电子邮件的全部内容；聊湾为用户提供的其他信息。所有这些内容受版权、商标、标签和其它财产所有权法律的保护。所以，用户只能在聊湾和广告商授权下才能使用这些内容，而不能擅自复制、再造这些内容、或创造与内容有关的派生产品。聊湾所有的文章版权归原文作者和聊湾共同所有，任何人需要转载聊湾的文章，必须征得原文作者或聊湾授权。
 
</textarea></td>
          <td vAlign="top" width="31" height="301" rowspan="4">
          <table border="0" cellpadding="0" cellspacing="0" style="border-collapse: collapse" bordercolor="#111111" width="9%" id="AutoNumber2" height="353">
            <tr>
              <td width="100%" height="134" valign="top"><br>
                                      
              
              
              </td>
            </tr>
            <tr>
              <td width="100%" height="19">　</td>
            </tr>
            <tr>
              <td width="100%" align="right" height="200">
          　</td>
            </tr>
          </table>
          </td>
        </tr>
        <tr>
          <td width="462" height="31">
          <font color="#FF0000"><b>选择要注册的网站</b></font></td>
          </tr>
		<tr>
          <td vAlign="top" width="462" height="42">
<%
Call OpenChatConn()
sql="select * from newweb order by webid asc"
set rsm=chatconn.execute (sql)
%>

&nbsp;<%
do while not (rsm.eof or err)
%> 
<a href="<%=rsm("regurl")%>" target="_blank"><%=rsm("weburl")%></a>

<% rsm.moveNext
  loop
  rsm.close
%>
          </td>
          </tr>
        <tr>
          <td vAlign="top" width="462" height="24" align="center">
          <a href="regfrom.asp"><img border="0" src="img/accept.gif"></a>&nbsp;&nbsp;
          <a href="../index.asp"><img border="0" src="img/rejec.gif"></a></td>
          </tr>
      </table>
      </td>
    </tr>
    <tr>
      <td width="650" height="47">　</td>
    </tr>
          <tr>
          <td background="../images/vip_dot.gif" height="1" width="650"></td>
        </tr>
    <tr>
      <td width="650" height="19">　</td>
    </tr>
  </table>
  </center>
</div>

    
<%call endpage()
%>