<%
'========================美美在线----美美设计========================
'
'程序修改: 网际浪子
'主页地址: http://www.liaowan.com/
'给我留言: http://www.liaowan.com/guestbook.asp
'E - mail: xzggg@126.com
'
'本程序可免费提供给非商业性的个人或团体组织站点使用.
'为了更好的进行技术交流，请保留版权信息和美美在线----美美设计 mz126.com 的友情链接,谢谢！
'
'========================美美在线----美美设计========================
%>
 <font size="2"><br>
【 美美在线----美美设计系统版权及免责声明 】 <br>
<br>
1、美美在线----美美设计系统，由视点开发，享有该软件版权和知识产权. 
<p>2、您现在使用的是美美在线----美美设计为您提供的ACCESS免费版本。本版本免费提供给个人网站学习研究和非商业性使用。</p>
<p>3、您可以根据需要对本系统进行必要的修改和美化，但必须保留程序的版权信息。</p>
<p>4、您可以复制、转载和传播美美在线----美美设计系统ACCESS免费版，但未经书面授权，不得向任何第三方提供个人更名的修改版本，更不能和于其他图利行为，否则，我们将依法追究你的法律责任和经济责任。</p>
<p>5、您在使用或传播中如果出现任何问题和由此造成的任何损失，美美在线----美美设计将不承担任何责任。利用本系统建设的网站的内容以及导致的任何法律争议和后果与美美在线----美美设计及本系统无关。 
</p>
<p>6、未尽事宜以美美在线----美美设计最新公告和相关法律为准。</p>
<p>请自觉遵守上述版权声明。凡有侵权行为的个人、法人或其它组织，必须立即停止侵权并对其因侵权造成的一切后果承担全部责任和相应赔偿。否则我们将依据中华人民共和国《著作权法》、《计算机软件保护条例》等相关法律、法规追究其经济和法律责任。</p>
<p><br>
  ---------------------------------------------------------------------</p>
<p>版权所有: 美美在线----美美设计mz126.com<br>
  程序修改: 网际浪子<br>
  主页地址: http://www.liaowan.com/</p>
<p>---------------------------------------------------------------------</p>
<p>Copyright 2003-2004 www.mz126.com All Rights Reserved.</p>
</font>
<p><font size="2">---------------------</font>------------------------------------------------</p>
