<p><font size="2">龙软下载站软件上传/添加帮助手册 试行版<br>
<br>
一.总则<br>
<br>
1.为了规范本站软件上传/添加方法,提高工作效率.根据多位管理者日常工作经验,特制定本手册.<br>
2.为了使本站下载链接不出现死链接,影响用户相信度,故所有下载软件采用本地下载方式.不引用任何远程链接<br>
3.所有要添加到下载站的软件必须上传至本站下载服务嚣.<br>
<br>
二.软件 压缩包 制作方法<br>
<br>
1.从各大下载站收集所需软件.<br>
(http://www.chinaz.com http://www.k666.com http://aspcool.com http://csdn.com)<br>
<br>
<br>
2.对所收集软件进行杀毒.或可确信不含病毒.<br>
<br>
<br>
3.删除其他网站的介绍文件如 k666.txt chinaz.com.txt 说明.htm 这些其他网站的介绍文件<br>
<br>
<br>
4.下载本站的介绍文件。http://lwoo.net/soft/wenjian.rar 解压缩后得到两个介绍文件<br>
<br>
<br>
5.将这两个介绍文件包含到压缩包里面。<br>
<br>
<br>
6.将制作好的软件包<span lang="zh-cn">通过</span>FTP 或着 WEB 方式上传到本站下载服务嚣相关目录.(具体见下)<br>
<br>
<br>
(4-1)本站下载站服务嚣地址ftp://www.lwoo.com/,用户名和密码需向上级请示得知.<br>
<br>
<br>
(4-2)不同类型软件要上传到服务嚣中&quot;文件夹说明.txt&quot;中指出的相关目录中.<br>
<br>
7.到此完成文件包的制作和上传。<br>
<br>
<br>
<br>
三.软件添加<br>
<br>
1.确认已经将文件包上传到服务器的正确目录下了<br>
<br>
2.后台使用表单添加软件.<br>
<br>
3.表单填写过程一定 看注释。<br>
<br>
4.注意：我们站不使用外连接。<br>
<br>
5.软件截图不要做任何处理直接上传到服务器就可以了。<br>
<br>
6.与到问题与软件数据部长 虫虫联系。<br>
<br>
<br>
注意：如果软件没有截图 那么截图表单项目里面就不要填写内容。<br>
<br>
<br>
四.其它<br>
<br>
更多信息正在添加中...<br>
<br>
wing 2004/3/21</font><br>
<br>
　</p>
