/***********************************聊湾聊天室配置lwbh1.0版****************************
* 本配置脚本原为真情论坛 真情相约聊天室脚本配置 特为聊湾修改而成.  *
* 重新修改整理,对代码进行了精简合理化,力求达到程序运行稳定快速而不失实用功能和美观界面  本版本新增加了多个视频功能   *
* 由于作者水平有限,程序难免错漏,如果你在使用过程中发现任何问题,请至信153251392@qq.com     *
* 本配置版权属真情论坛,你可以随意使用和传播.如用于商业用途请和作者联系                     *
* 在此特别感谢以上脚本作者,如有冒犯之处,还请见凉                                           *
*                                           碧海  冀人老刀QQ:153251392                        *
*    真情论坛 http://www.369590.com     2004.9.9添加晚会嘉宾（假人）代码  9.17添加机器人 本脚本已加密 联系 冀人老刀 QQ153251392              *
*******************************************************************************************/
