var m_fullscreen_bgimage = parent.u.document.body.background;
var a_user = document.inputform.USER.value;
var a_pass = document.inputform.PASS.value;

var cipdz="" ;    //后台管理地址
enable_auto_log("")

var config_place = "http://pic.liaowan.com/gif/";  //	图片等的存放位置，请设定为您存放图片的位置

var room_owner="*月，淡淡笑";"";			//室主名称
var room_name="超级女声";			//	房间名称
var room_adminname_head="*";	//	本室管理名格式
var room_adminname_headg="*";	//	本室歌手名格式
var majia = "" ;            //   默认换马甲格式

var room_number="2034";			//	房间号
var black_roomname="";	//	双工房间名称   如果允许双工，空
var black_roomnumb="";	//	双工房间号码
var room_link_url = "http://"+room_number+".liaowan.com";

//	聊友列表区顶部HTML代码
var userlist_top_html = "<table border=0 width=120px cellspacing=0></td><tr></tr><tr><td align=middle><img src=http://yueer.w14.11web.net/bbs/images/upload/2004/10/22/155859.gif><tr><td align=middle><img src=http://pic.liaowan.com/gif/hx.gif></td></tr><tr><td align=middle><marquee scrollamount=1><font color=Olive size=2><b>室主：*月，淡淡笑 欢迎<font color=Olive><b>〖"+document.inputform.USER.value+"〗</b></font>来到<font color=Olive>★★</font><font color=red>希望你在这里玩的开心！要麦打999，试麦打666</font></marquee></td></tr></table>"; //聊友列表区头部显示
var userlist_bottom_html = "<marquee scrollamount='2' > <font color=2e8b57> "+room_name+"欢迎</font><font color=ff0000>『"+a_user+"』</font><font color=2e8b57>的到来！要麦向红衣管理打9999 </font></marquee></a>";

//	聊友列表区底部框内文字代码
var listbottem0="〓★室主★〓<BR>"+room_owner+"<BR>欢迎你的到来<BR>"+room_name+"<Br>是我们<Br>共同的家";

var userlist_bkcolor = "#e5fffd";	//	聊友列表区的背景色
var userlist_bkimage = "http://yueer.w14.11web.net/bbs/images/upload/2004/10/22/155849.jpg";			//	聊友列表区的背景图，设置为空串则使用输入区的图片
var voice_normal_color = "#00D000";	//	正常打开语音时的图标颜色
var voice_v2v_color = "#000000";	//	双工语音时的图标颜色
var voice_vr_color = "#00D000";		//	有视频时的图标颜色

var div_screen_bkcolor = "e5fffd";		//	分屏背景色
var div_screen_bkimage = "";		//	分屏背景图片	

var voice_bkcolor = "#e5fffd";		//	语音区的背景
var voice_bkimage = "fp.gif";				//	语音区的背景图，空串则使用聊友区图片

var input_bkcolor = "#e5fffd";		//	输入区背景色
var input_bkimage = "http://www.waternet.com.cn/happy/tp/xl.gif";				//	输入区背景图片
var input_msg_color	= "#0000ff";	//	输入区文字输入框文字色
var input_msg_bkcolor = "#ffffff";	//	输入区文字输入框背景色

var body_text_color	= "#038ffe";	//	输入区文字色
var select_color = "#038ffe";		//	列表框文字色
var select_text_color = "#038ffe";	//	列表框内文字色
var button_text_color = "#660099";	//	输入区按钮文字色
var button_bk_image	= 1;			//	按钮使用背景图片，1--使用，0--不使用
var button_bk_color = "";			//	输入区按钮不使用图片时背景色

var full_screen_bkimage	= 1;		//	是否使用整体背景图片0--不使用，1--使用   2--半整体
var auto_hide_scrollbar = 0;		//	整体背景时是否自动隐藏滚动条0--不隐藏，1--隐藏

//	按钮背景图片  宽度,文件名
var a_btn_pic = new Array
(
	17,		"http://www.slky.net/user/li8273/btn19.gif",
	18,		"http://www.slky.net/user/li8273/btn19.gif",
	19,		"http://www.slky.net/user/li8273/btn19.gif",
	35,		"http://www.slky.net/user/li8273/btn27.gif",
	46,		"http://www.slky.net/user/li8273/btn35.gif",
	70,		"http://www.slky.net/user/li8273/btn46.gif"
);


var url_popup_window = "";			//	进入聊天室时弹出的窗口，如果为空则不弹出
var	only_registr_user = 0;			//	只允许注册用户进入,0——不限制；1——只允许注册用户进入
var	only_chinese_name = 0;			//	只允许汉字名用户进入,0——不限制；1——只允许汉字名用户进入
var default_admin_pass = "999";	//	默认的管理员上管口令

var auto_open_ai = 1;				//	自动打开图音,0——不打开；1——自动打开
var auto_open_div = 1;				//	自动分屏,0——不分屏；1——自动分屏
var multi_singer_list = 0;			//	是否允许重复排麦，0——不允许；1——允许
var qqh=0;                             //    是否默认悄悄话   0---默认公开   1---默认悄悄   2---强制悄悄     3----只鲜花强制悄悄


var msg_login		=	"大家好，是我〖"+a_user+"〗来了！！《" + room_name + "》是我真正的家~~~";
var msg_admin		=	"大家好，〖"+a_user+"〗上管了,由我来为大家服务  :)  ";
var msg_quitadmin	=	"〖"+a_user+"〗先下管了，谢谢大家对我的支持！！";
var msg_leave		=	"各位：〖"+a_user+"〗先行一步了,下次再和大家聊！";

//	分屏公告文字
var div_msg_color4 = "#80a0ff";		//	分屏公告颜色
var div_msg_color3 = "#80a0ff";		//	分屏公告颜色

var div_msg1 = "";
var div_msg2 = "";
var div_msg3 = "欢迎光临聊湾聊天网【"+room_name+"】多视频聊天室!~~连接多视频请直接点名字后小眼睛";
var div_msg4 = "【超级女生】室主:*月，淡淡笑 ☆欢迎您光临本聊天室。如副室主和管理没时间来聊天室请在室主QQ里留言。本室招收管理。有意者请与在线高管及室主联系.";  //通知
var div_link = "";

//	用于连接按钮
var jilu="http://yueer.w14.11web.net/jiaoben/manage/showadmin.asp";   //刷卡器地址   空时没有

/////6项/////
var a_link_button = new Array
(
	"论坛","http://yueer.w14.11web.net/bbs",
	"主页","http://www.163888.net/sing/showuser.aspx?uid=99942",
	"伴奏","http://www.l521.com",
	"女声","http://www.hunantv.com/supergirl/default.htm",
	"电台","http://www.poppip.com/bbs/",
	"点歌","http://www.poppip.com/bbs/club_index.php?index=song"
);

//	本室中的 VIP 聊友
//	级别：0---在线主持  1--房主；2--室主  3--副室主4-----高级管理   5---管理员格式  6----歌手格式    7--注册马甲  8----汉字马甲   9---数字马甲
var a_vip_user = new Array
(
"*月，淡淡笑",	1,
"*じ☆ve海之夢",	1,
"*",	         4,
"*",	3,
"*",	3,"*",	2,
"*",	1,
"*",	4,"*",	3,
"*",	2,
"*",	2,
"*",  4,  "*",	4, "*",	4,"*",	4,"*",	4,"*",	4,
"*",	4,
"*",	5,
"*",	4,
"*",	5,
"*",	6,
"*",	4,
"*",	5,
"*",	1,
"*",	1,
"*",	1,
"*",	5,"*",	5,"*",	5,"*",	5,"*",	5,"*",	5,"*",	5,"*",	5,"*",	5,
"*",	5,
"*",	5,
"*",	4,
"*",	5,
"*",	4,
"*",	5,
"*",	5,
"*",	6,"*",	6,"*",	6,"*",	6,
"*",	6,
"*",	6,
"*",	5,
"*",	6
);

//--聊友名过滤，凡是名字中包含下面文字的聊友，只要不是上面的VIP聊友，不准进入房间--
var a_name_filter = new Array
(
	"法轮功",
       "妈",
	"你爹",
	"王八"
);


//——隐身人：名称，隐身等级。下面的名字是可以隐身的，但级别等于隐身级别的聊友可以看到他的名字——
var a_hide_user = new Array
(
	"*", 0,"*",0,"",1,"*",1

);


// 第一步　添加便衣马甲数组
//      便衣马甲
     var bianyi = new Array
     (
     "*ぺ灬無怨灬ぺ",
     "*",
     "*",
     "*"
      );


//——聊友说明，在此修改聊友名字的颜色——   （0到9）
var a_usertitle = new Array
(
	0,	"在线管理",	"yg.gif",	"#FF0000",	"#ffffff",
	1,	"站长巡管",	
         "http://web.fs169.net/xiongmaolei/liao/87383.gif",	"#000000",	"#ffffff",
	2,	"本室室主",	
         "http://www.newliao.com/nchat/pic/002.gif",	   "#cc33cc",	  "#ffffff",
         3,	"本室副室",	"http://www.sz22.com/web/sunhongli/love002.gif", 
          "#ff00ff","#ffffff",
         4,	"本室管理",	"http://www.sz22.com/web/sunhongli/love006.gif", "#FF8000",	"#ffffff",
	5,"本室贵宾",     "http://asp5.6to23.com/gyyj2001/my/ao1.gif",	 "#970097",	"#ffffff",	
	6,	"本室贵宾",	"http://asp5.6to23.com/gyyj2001/my/ao1.gif",	"#008C00",	"#ffffff",
	7,   "聊湾嘉宾",      "http://sz22.com/web/sunhongli/love007.gif",	"#2c07fe",	"#ffffff",
	8,	"聊湾过客",	"http://sz22.com/web/sunhongli/love008.gif",	"#2c07fe",	"#ffffff",
	9,	"聊湾过客",	"0004.gif",	"#2c07fe",	"#ffffff"
);

// 不可踢马甲
var wudimajia=new Array("*","*","*","*","*",
"*月，淡淡笑","*じ☆ve海之夢","","*","*","*"
 );  



//——房间走廊,请注意房间号的写法——
var a_roomlink = new Array
(
	black_roomname,	black_roomnumb,
	"超级女生",	"2034",
	"等您加入",	"0000",
	"等您加入",	"0000",
	"等您加入",	"0000",
	"等您加入",	"0000",
	"等您加入",	"00000000",
	"等您加入",	"0000",
	"等您加入",	"0000",
	"等您加入",	"0000",
	"等您加入",	"0000",
	"等您加入",	"0000",
	"等您加入",	"0000",
	"等您加入",	"0000",
	"等您加入",	"0000",
	"等您加入",	"0000",
	"等您加入",	"0000",
	"等您加入",	"0000",
	"等您加入",	"0000",
	"等您加入",	"0000",
	"等您加入",	"0000",
	"等您加入",	"0000",
	"等您加入",	"0000",
	"等您加入",	"0000",
	"等您加入",	"0000",
	"等您加入",	"0000",
	"等您加入",	"0000",
	"等您加入",	"0000",
	"等您加入",	"0000",
	"等您加入",	"0000",
	"等您加入",	"0000",
	"等您加入",	"2043",
	"等您加入",	"2035",
	"等您加入",	"2010",
	"等您加入",	"2034",
	"等您加入",	"2019",
	"等您加入",	"2001",
	"等您加入",	"2020",
	"等您加入",	"2038",
	"等您加入",	"2023",
	"等您加入",	"2016",
	"等您加入",	"2026",
	"等您加入",	"2008",
	"等您加入",	"2025",
	"等您加入",	"2046",
	"等您加入",	""
);

now = new Date(),hour = now.getHours()
if(hour < 6){ var wenhao="你好!这么早,天还没亮呢!"; }
else if (hour < 9){var wenhao="早上好!";}
else if (hour < 11){var wenhao="上午好!";}
else if (hour < 14){var wenhao="中午好!";}
else if (hour < 18){var wenhao="下午好!";}
else if (hour < 23){var wenhao="晚上好!";}
else {var wenhao="你好!夜深了你还不想睡吗?";}


//--房间链接--
var a_linkurl = new Array
(
	"热线连接",		"",
	"真情论坛",		"",
	"聊湾注册",		"http://liaowan.com/USadmin/regadd.asp",
	"聊湾帮助",		"http://liaowan.com/help/",
	"伴奏网址",		"",
	"音乐擂台",		"http://www.tvma.com.cn/xianshangliange/banzouxiazai.asp",
       "伴奏音乐",          "http://www.meetchinese.com/song/music.html",
       "兰色伴奏",          "http://www.l521.com/banzou/",
       "歌友伴奏",         "http://www.163888.net/blist.asp",
	"音乐网",		"http://mtv99.com",
	"搜刮搜索",		"http://www.sogua.com",
	"极限搜索",		"http://www.chinamp3.net/search/index.php",
	"百度mp3",		"http://mp3.baidu.com",
	"百度flas",		"http://flash.baidu.com",
	"管理后台",		"http://pic.liaowan.com/houdai/admin.asp",
	"房间管理",		"http://liaowan.com/roomadmin/",
	"后台管理",		""+cipdz+""
);



//--欢迎--
var a_welcome = new Array
(
	"欢迎",	"★《 "+room_name+" 》欢迎你！坐┳┳请坐┳┳┳请上坐┳┳┳┳！★ ( http://"+room_number+".liaowan.com)",
	"欢迎",	"☆"+room_name+"☆欢迎您的光临，愿您在这里玩儿的开心！玩儿的愉快！( http://"+room_number+".liaowan.com) ",
	"欢迎",	"你好，请坐，请上坐┳━┳━┳ .给您端上热咖啡一杯.免费赠送的哦~~~还有奶茶~！( http://"+room_number+".liaowan.com) ",
	"欢迎",	"●◢◤◥◣◢◤◥ "+room_name+" ◣◢◣◢◤◥◣聊◢◤◥◣天◢◤◥◣室◢◤◥◣欢◢◤◥◣迎◢◤◥◣您● ( http://"+room_number+".liaowan.com) " 
);


//--献花--
var a_flower = new Array
(
	"醉倒",	"醉倒!★真好听 * ．给我签个名吧！哎..大家不要挤嘛..呦..呦..谁踩俺脚了..哎~~签哪儿呢？..就签俺衣服上吧！要带唇印的哦~保安~我的鞋~",
	"签名",	"■~唱的太棒了~～☆★☆～~我听的都醉了~～☆★～~给我签个名吧~ ～☆★☆～~哇~～！！～~唱的太棒了~～☆★☆～~我听的都醉了~0~",
	"醉了",	"哗啦啦---下雨拉｀、｀、｀、｀、好听｀给你雨伞、迷死了｀、｀、｀、鲜花｀、｀、｀、｀、｀、好听｀给你雨伞、迷死了｀、｀、｀",
	"迷人",	"¤¤¤¤¤¤¤¤¤好棒哦¤¤¤¤¤¤¤迷死了¤¤¤¤¤¤¤好棒哦¤¤¤¤¤好棒哦¤¤¤¤¤¤好棒哦¤¤¤¤¤啪啪啪¤¤¤¤",
	"歌星",	"艺术家！！专业歌星~~~~ぷ╰哗...☆╮ぷ╰☆╮满天星★☆ぷ(((((啪啪)))))ぷ╰ぷ╰签名！签名！)嘿！哥们~~~~别挤嘛 **我的鞋呢？眼镜？ ",
	"玫瑰",	"玫瑰花☆╮╮芍药花☆╮╰☆☆╮合欢花╰☆☆╮喇叭花╰☆☆╮爆米花╰☆☆╮鱿鱼花╰☆☆╮葱花╰☆☆╮ 礼花～～腰花～～杠上花",
	"歌星",	"☆★．°■ ．☆°*°●★ ．歌星啊！真好听 * *．★☆多美妙的声音啊★*°☆* 太棒了！∴°★★°真的是你唱的吗？我怀疑是歌星唱的啊！！* ~",
	"偶像",	"☆☆★∴☆∵*☆★∴☆∵≈☆￡鲜花≈☆￡鲜花偶像～～签名～～～ ∵*☆★∵ ∵*☆★∴☆∵*☆★∴☆∵偶像～～签名～～～ ∵*☆★∴☆∵",
	"百荷",	"★☆ぷ╰☆╮ぷ╰☆╮满天星★☆ぷぷ(((((((((啪啪))))))))ぷ╰☆╮紫丁香★☆ぷ╰☆╮水仙花★☆ぷ╰☆╮ぷ╰☆╮野百荷★☆ぷ╰☆╮ぷ",
	"真棒",	"唱的真棒~~╰☆☆╮茉莉花╰☆☆鼓掌（（（PA PA）））玫瑰╰☆☆╮百合╰☆☆╮牡丹╰☆☆╮茉莉╰☆☆╮还有一枝勿忘我－紫风铃",
	"郁金",	":→◥◣★☆★◢◤★↘*郁金香∴→◥◣★☆★◢◤★℡↘*郁金香∴→◥◣★☆★◢◤★ ↘ *郁金香∴→◥◣★☆★◢◤★↘",
	"啪啪",	"*^_^*《啪》 *^_^*《啪》 *^_^*《啪》 *^_^* *^_^*《啪》 *^_^*《啪》 *^_^*《啪》 *^_^*《啪》 *^_^*",
	"水仙",	"玫瑰花★☆ぷ╰☆╮ぷ╰☆╮满天星★☆ぷ╰☆╮ぷ(((((((((啪啪))))))))ぷ╰☆╮紫丁香★☆ぷ╰☆╮ぷぷ╰☆╮水仙花★☆ぷ╰☆╮ぷ╰☆╮",
	"牡丹",	"* *．°牡丹★·。 *菊花∴ * *夜来香∴°一筐一筐又一筐∴牡丹★·。 *菊花∴ * *夜来香∴°★·君子兰* *．°一筐一筐又一筐∴"
);


//--送行--
var a_byebye = new Array
(
	"不舍","走好，再见，祝您开心快乐",
	"走好","好的，拜拜！祝您开心快乐 "
);


//--告辞--
var a_leave = new Array
(
	"想留",	"Bye~~~~~~~~~再见，我要下了，祝您开心快乐~~~~~~~~~~~ ",
	"告别",	"Bye~~~~~~~~~再见，我要下了，祝您开心快乐~~~~~~~~~~~~ "
);

//--答谢--
var a_da = new Array
(
	"多谢",	"多谢多谢!!谢谢大家!!!!  ",
	"多谢",	"谢谢朋友们的鲜花,掌声和鼓励!!!",
	"多谢",	"衷心感谢朋友们的热情!!! "
);

//--文明--
var a_wen = new Array
(
	"文明","提醒**请您文明聊天,注意自己的语言或名称,是和朋友开玩笑请用悄悄话,谢谢合作!!!!! ",
	"文明","提醒**请您文明聊天,注意自己的语言或名称,是和朋友开玩笑请用悄悄话,谢谢合作!!!!!! "
);

//--换名--
var a_huan = new Array
(
	"换名","我们的房间不欢迎这样的名字，请您换个名字进来，不然我请您出去换了，谢谢您的合作 ",
	"换名","我们的房间不欢迎这样的名字，请您换个名字进来，不然我请您出去换了，谢谢您的合作! "
);

//--要麦--
var a_wantmic = new Array
(
	"要麦",	"999999999999999999999999我要麦呀9999999",
	"唱歌",	"999999999999999999999999我要麦呀99999999"
);

//--听见--
var a_heart = new Array
(
	"听见",	"||||||||||||||||||||||||听见了",
	"听见",	"|||||||||||||||||||||||||听见了"
);


//--搅拌--
var a_dai = new Array
(
	"搅拌",	"管理员，我要搅拌啊9999999999999999999999999，可以吗？(麦序超过5个俺就不搅拌了) ",
	"搅拌",	"管理员，我要搅拌啊9999999999999999999999999，可以吗？(麦序超过5个俺就不搅拌了)   "
);

//--准备--
var a_zhun = new Array
(
	"准备",	"您好!下一位到您接麦了,请您做好准备~~!(看到了请回信)谢谢 ",
	"准备",	"您好!下一位到您接麦了,请您做好准备~~! (看到了请回信)谢谢"
);

//--邀麦--
var a_yao = new Array
(
	"邀麦",	"☆⌒_⌒．☆°您好!亲爱的朋友,欢迎你的到来,你可以给大家唱一首歌吗？谢谢☆⌒_⌒．☆",
	"邀麦",	"☆⌒_⌒．☆°您好!亲爱的朋友,欢迎你的到来,你可以给大家唱一首歌吗？谢谢☆⌒_⌒☆"
);

//--网址--
var a_wang = new Array
(
	"网址",	"聊天室网址："+room_link_url+" ",
	"网址",	"聊天室 网址："+room_link_url+" "
);

//--试麦--
var a_shi = new Array
(
	"试麦",	"管理员，您好。我要试麦66666666666666666666666 ",
	"试麦",	"管理员，您好。我要试麦666666666666666666666666 "
);

//--拒聊--
var a_ju = new Array
(
	"拒聊",	"很抱歉，我正在上管理主持，不能和您聊天，请谅解。 ",
	"拒聊","很抱歉，我正在上管理主持，不能和您聊天，请您谅解。 "
);

//--未开麦--
var a_wei = new Array
(
	"您未开麦",	"您好!请您打开语音或是退全双工对话,否则我们是递不了麦给您的哦 ",
	"您未开麦","您好!请您打开语音或是退全双工对话,否则我们是递不了麦给您的哦   "
);

//--麦无声音--
var a_wu = new Array
(
	"麦无声音",	"您好!亲爱的朋友,我们递麦给您,您的麦没有声音,请您再调试一下麦克,再向我们要麦好吗 ",
	"麦无声音","您好!亲爱的朋友,我们递麦给您,您的麦没有声音,请您再调试一下麦克,再向我们要麦好吗   "
);

//--请您接麦--
var a_jie = new Array
(
	"请您接麦",	"您好!请您接麦,不好意思,让您久等了,请接好您的麦克风 ",
	"请您接麦","您好!请您接麦,不好意思,让您久等了,请接好您的麦克风   "
);

//--已经排麦--
var a_yi = new Array
(
	"已经排麦",	"您好!我已为您排麦,请您耐心待等候。也请准备一下 为我们献上你的风采！ ",
	"已经排麦", "您好!我已为您排麦,请您耐心待等候。也请准备一下 为我们献上你的风采！    "
);

//--您麦不好--
var a_duan = new Array
(
	"您麦不好",	"您好!可能是您的麦有问题或是网速太慢,我们听到的是断断续续的声音,请您再调试一下再要麦好吗?谢谢 ",
	"您麦不好",   "您好!可能是您的麦有问题或是网速太慢,我们听到的是断断续续的声音,请您再调试一下再要麦好吗?谢谢   "
);

//--请您关麦--
var a_guan = new Array
(
	"请您关麦",	"朋友，请关上您的麦克！请您点击又下角的麦克风图标，使其变成红叉，这样您就不会断别人的麦！当您想说话和唱歌时，请您再点击一下，红叉消失即可说话！谢谢合作 ",
	"请您关麦",   "朋友，请关上您的麦克！请您点击又下角的麦克风图标，使其变成红叉，这样您就不会断别人的麦！当您想说话和唱歌时，请您再点击一下，红叉消失即可说话！谢谢合作   "
);

//--拒绝双工--
var a_shuang = new Array
(
	"拒绝双工",	"您好!十分对不起，我现在不能和您双工，请您谅解。  ",
	"拒绝双工",  "您好!十分对不起，我现在不能和您双工，请您谅解。    "
);

//--打黑警告--
var a_hei = new Array
(
	"打黑警告",	"打黑打黑~！快出来吧~！~没氧气了~！~！快出来吧~！~小心PP  ",
	"打黑警告",  "打黑打黑~！快出来吧~！~没氧气了~！~！快出来吧~！~小心PP    "
);

//--游戏横线--
var a_heng = new Array
(
	"游戏横线",	"恭喜横线上和下朋友中奖===============================================   ",
	"游戏横线",  "恭喜横线上和下朋友中奖===============================================     "
);

//--话题--
var huati = new Array
(
	"话题",	""+div_msg4+"",
	"话题",  ""+div_msg4+"  "
);

//	管理专用
var a_admin = new Array
(
	"本室网址",	"聊天室网址 "+ room_link_url ,"color:#009900",
	"请您准备",	"您好，欢迎来到“《" + room_name + "》”，下一个就是您的麦了,请准备好!!!!","",
	"拒绝双工",	"您好!十分对不起，我现在不能和您双工，请您谅解。 ","color:#6600ff",
	"拒绝聊天",	"您好!十分对不起，我现在正在上管不能和您聊天，请您谅解。 ","color:#6600ff",
	"已经排麦",	"您好!我已为您排麦,请您耐心待等候!","",
	"请您接麦",	"您好!请您接麦,不好意思,让您久等了,请接好您的麦克风!","",
	"请您关麦",	"朋友，请关上您的麦克！请您点击又下角的麦克风图标，使其变成红叉，这样您就不会断别人的麦！当您想说话和唱歌时，请您再点击一下，红叉消失即可说话！谢谢合作！","",
	"请开语音",	"您好!请您打开语音或是退全双工对话,否则我们是递不了麦给您的哦!!","",
	"文明聊天",	"提醒**请您文明聊天,注意自己的语言或名称,是和朋友开玩笑请用悄悄话,谢谢合作!!!!! ","",
	"打黑警告",	"打黑打黑~！快出来吧~！~没氧气了~！~！快出来吧~！~没氧气了~！~！","",
	"请您换名",	"我们的房间不欢迎这样的名字，请您换个名字进来，不然我请您出去换了，谢谢您的合作。","",
	"换注册名",	"请您换一个文字名字或注册名字好吗，这样大家会记住您的，大家叫您时也方便！谢谢","",
	"您麦不好",	"您好!可能是您的麦有问题或是网速太慢,我们听到的是断断续续的声音,请您再调试一下再要麦好吗?谢谢.","",
	"麦无声音",	"您好!亲爱的朋友,我们递麦给您,您的麦没有声音,请您再调试一下麦克,再向我们要麦好吗?",""
);


//--EMOTE--
var a_emote = new Array
(
	"☆问候☆",		"",
	"He你好",		"//hello",
	"Hi你好！",		"//hi",
	"愉快招呼",		"//greet",
	"热烈欢迎",		"//welcome",
	"和您握手",			"//hand",
	"请多关照",		"//visit",
	"公子有礼",		"//boy",
	"愉快表情",		"//:)",
	"对他笑笑",		"//:)2",
	"热情拥抱",		"//bearhug",
	"坐在一起",		"//sit",
	"弯腰鞠躬",		"//bow",
	"你太客气",		"//welcome2",
	"生日快乐",		"//birthday",
	"热烈鼓掌",		"//clap",
	"大喊加油",		"//addoil",
	"献朵玟瑰",		"//rose",
	"热的牛奶",		"//milk",
	"热茶包子",		"//tea",
	"喝了再说",		"//wine",
	"替您擦汗",		"//sweat",
	"小蘑菇吃",		"//gzxj",
	"打打哈哈",		"//ha",
	"哈哈大笑",		"//haha",
	"疑惑看着",		"//?",
	"壮士过奖",		"//cool",
	"做鬼鬼脸",		"//face",
	"你真好",		"//thank",
	"高实在高",		"//gao",
	"傻笑几声",		"//he",
	"想说什么",		"//en",
	"吐舌头",		"//:p",

	"☆调情☆",		"",
	"发誓爱你",		"//ai",
	"天真望著",		"//@@",
	"昏倒怀抱",		"//faint",
	"飞了过去",		"//fly",
	"嘴巴堵你",		"//ds",
	"这个女人",		"//girl",
	"过去答讪",		"//go",
	"好喜欢你",		"//ppp",
	"我爱上你",		"//love",
	"真的是你",		"//miss",
	"真的是你",		"//wait4",
	"我在等你",		"//waiting",
	"等的花谢",		"//wait3",
	"含宝脉脉",		"//love3",
	"眼眸眨眨",		"//lovesee",
	"含情脉脉",		"//lovelook",
	"撩人诱惑",		"//lure",
	"向你求婚",		"//marry",
	"好象见过",		"//mm",
	"脸好热热",		"//shy",
	"飘飘欲仙",		"//smoke",
	"陶醉跳舞",		"//dance",
	"无辜望著",		"//inn",
	"轻轻拥抱",		"//hug",
	"轻轻抚摸",		"//care",
	"抚摸对方",		"//caress",
	"爱怜抚摸",		"//touch",
	"轻轻拍头",		"//pat",
	"依偎怀里",		"//lean",
	"跳入怀里",		"//jump",
	"啵亲一下",		"//kiss",
	"热情拥吻",		"//smooch",
	"亲了N口",		"//lly",
	"疯吻对象",		"//xixi",
	"用爱折磨",		"//zhemo",
	"做我姐姐",		"//qsister",
	"做我妹妹",		"//qsister1",
	"做我弟弟",		"//qbrother",
	"做我哥哥",		"//qbrother1",
	"鸡皮疙瘩",		"//cold",
	"苦水倒出",		"//:(",
	"乞求怜悯",		"//cringe",
	"在肩上哭",		"//cry",
	"唉叹口气",		"//sigh",

	"☆打斗☆",		"",
	"将蛋扔去",		"//allen",
	"流口水",		"//drivel",
	"坏欺负人",		"//bad",
	"咬他哇叫",		"//bite",
	"你这变态"
